app/controllers/admin/dashboard_controller.rb

    def index
      @total_users = User.count
      @total_produtos = Produto.count
      @produtos = Produto.includes(:user)
---
SELECT COUNT(*) FROM "users"
SELECT COUNT(*) FROM "produtos"
SELECT "produtos".* FROM "produtos"