app/controllers/produtos_controller.rb

  def create
    @produto = Produto.new(produto_params)

    respond_to do |format|
      if @produto.save
---
INSERT INTO "produtos" ("nome", "preco", "data_validade", "quantidade_estoque", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"

  def update
    respond_to do |format|
      if @produto.update(produto_params)
---
UPDATE "produtos" SET "nome" = ?, "updated_at" = ? WHERE "produtos"."id" = ?  [["nome", "teste edição"], ["updated_at", "2024-05-15 00:47:53.206884"], ["id", 1]]

  def destroy
    @produto.destroy!
---
DELETE FROM "produtos" WHERE "produtos"."id" = ?  [["id", 1]]